In [1]:
# complex number

In [2]:
x=10+16J

In [3]:
print(x)

(10+16j)

In [4]:
type(x)

complex

In [5]:
y=100

In [6]:
x>y

TypeError: '>' not supported between instances of 'complex' and 'int'

In [8]:
x.real

10.0

In [9]:
x.imag

16.0

In [10]:
# Turnary Operator
'Even' if 100%2==0 else 'Odd'

'Even'

In [11]:
'Even' if 100%3==0 else 'Odd'

'Odd'

In [12]:
# Pandas Dummies Variable

In [13]:
import pandas as pd

In [14]:
house=pd.read_csv(r'C:\Users\HP P DTS\Desktop\Machine Learning\Data Set\house_cat.csv')

In [15]:
house.head()

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [19]:
house['town'].unique()

array(['monroe township', 'west windsor', 'robinsville'], dtype=object)

# Purpose
monroe township=1
west windsor=2
robinsville=3
1+2=3

In [20]:
dummy=pd.get_dummies(house['town'])

In [21]:
dummy.head()

   monroe township  robinsville  west windsor
0                1            0             0
1                1            0             0
2                1            0             0
3                1            0             0
4                1            0             0

In [22]:
dummy

    monroe township  robinsville  west windsor
0                 1            0             0
1                 1            0             0
2                 1            0             0
3                 1            0             0
4                 1            0             0
5                 0            0             1
6                 0            0             1
7                 0            0             1
8                 0            0             1
9                 0            1             0
10                0            1             0
11                0            1             0
12                0            1             0

In [23]:
df_dummy=pd.concat([house,dummy],axis='columns')

In [24]:
df_dummy

               town  area   price  monroe township  robinsville  west windsor
0   monroe township  2600  550000                1            0             0
1   monroe township  3000  565000                1            0             0
2   monroe township  3200  610000                1            0             0
3   monroe township  3600  680000                1            0             0
4   monroe township  4000  725000                1            0             0
5      west windsor  2600  585000                0            0             1
6      west windsor  2800  615000                0            0             1
7      west windsor  3300  650000                0            0             1
8      west windsor  3600  710000                0            0             1
9       robinsville  2600  575000                0            1             0
10      robinsville  2900  600000                0            1             0
11      robinsville  3100  620000                0            1             0
12      robinsville  3600  695000                0            1             0

In [25]:
features=df_dummy.drop(['west windsor','town'],axis=1)

In [26]:
features

    area   price  monroe township  robinsville
0   2600  550000                1            0
1   3000  565000                1            0
2   3200  610000                1            0
3   3600  680000                1            0
4   4000  725000                1            0
5   2600  585000                0            0
6   2800  615000                0            0
7   3300  650000                0            0
8   3600  710000                0            0
9   2600  575000                0            1
10  2900  600000                0            1
11  3100  620000                0            1
12  3600  695000                0            1

In [27]:
X=features.drop('price',axis=1)

In [28]:
X

    area  monroe township  robinsville
0   2600                1            0
1   3000                1            0
2   3200                1            0
3   3600                1            0
4   4000                1            0
5   2600                0            0
6   2800                0            0
7   3300                0            0
8   3600                0            0
9   2600                0            1
10  2900                0            1
11  3100                0            1
12  3600                0            1

In [29]:
y=features.price

In [30]:
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [76]:
from sklearn.linear_model import LogisticRegression
model=LogisticRegression(C=15)

In [40]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [38]:
y_test

8     710000
7     650000
5     585000
0     550000
1     565000
9     575000
10    600000
11    620000
4     725000
12    695000
Name: price, dtype: int64

In [77]:
model.fit(X_train,y_train)

E:\ProgramData\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
E:\ProgramData\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:469: FutureWarning: Default multi_class will be changed to 'auto' in 0.22. Specify the multi_class option to silence this warning.
  "this warning.", FutureWarning)

LogisticRegression(C=15, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [74]:
pred=model.predict(X_test)

In [51]:
y_test

11    620000
10    600000
12    695000
Name: price, dtype: int64

In [78]:
model.score(X_train,y_train)

0.5

In [58]:
df=pd.DataFrame(y_test)

In [59]:
df

     price
11  620000
10  600000
12  695000

In [63]:
X_test

    area  monroe township  robinsville
11  3100                0            1
10  2900                0            1
12  3600                0            1

In [65]:
model.predict([[3200,0,0]])

array([710000], dtype=int64)

In [66]:
y_test

11    620000
10    600000
12    695000
Name: price, dtype: int64

In [69]:
house

               town  area   price
0   monroe township  2600  550000
1   monroe township  3000  565000
2   monroe township  3200  610000
3   monroe township  3600  680000
4   monroe township  4000  725000
5      west windsor  2600  585000
6      west windsor  2800  615000
7      west windsor  3300  650000
8      west windsor  3600  710000
9       robinsville  2600  575000
10      robinsville  2900  600000
11      robinsville  3100  620000
12      robinsville  3600  695000